# ConnectionValidationInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationInfo Constructor
ConnectionValidationInfo Class See Also
---
Constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectionValidationInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ConnectionValidationInfo()
```

# See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace